beomodern/Main_uP/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.3
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2019 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "SPI.h"
#include "SPI_SPI_UART.h"
#include "SPI_PINS.h"
#include "SPI_SPI_UART_PVT.h"
#include "SPI_PVT.h"
#include "SPI_BOOT.h"
#include "PWR_OK_MODE.h"
#include "PWR_OK_MODE_aliases.h"
#include "PSoC_LED.h"
#include "PSoC_LED_aliases.h"
#include "LED.h"
#include "LED_aliases.h"
#include "SwClock.h"
#include "Bootloadable_1.h"
#include "Timer_2.h"
#include "PWR_OK_MODE_SHORT.h"
#include "Timer_1.h"
#include "Pin_1.h"
#include "Pin_1_aliases.h"
#include "MODE_LONG.h"
#include "PWR_OK_LONG.h"
#include "BT_SBC.h"
#include "BT_SBC_aliases.h"
#include "BT_PAIRING.h"
#include "BT_PAIRING_aliases.h"
#include "PWR_RPI.h"
#include "PWR_RPI_aliases.h"
#include "BT_APTX.h"
#include "BT_APTX_aliases.h"
#include "BT_LL.h"
#include "BT_LL_aliases.h"
#include "BT_HD.h"
#include "BT_HD_aliases.h"
#include "BT_Tx_Rx.h"
#include "BT_Tx_Rx_aliases.h"
#include "BT_NEXT.h"
#include "BT_NEXT_aliases.h"
#include "BT_PREVIOUS.h"
#include "BT_PREVIOUS_aliases.h"
#include "BT_PAUSE.h"
#include "BT_PAUSE_aliases.h"
#include "BT_RE_CONNECT.h"
#include "BT_RE_CONNECT_aliases.h"
#include "PWR_BT.h"
#include "PWR_BT_aliases.h"
#include "PWR_SDSP.h"
#include "PWR_SDSP_aliases.h"
#include "PWR_DISP.h"
#include "PWR_DISP_aliases.h"
#include "Em_EEPROM.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "DATALINK.h"
#include "DATALINK_aliases.h"
#include "SwClock_1.h"
#include "DATALINK_Timer.h"
#include "DATALINK_INTRRUPT.h"
#include "SPI_SCBCLK.h"
#include "SPI_ss_s.h"
#include "SPI_ss_s_aliases.h"
#include "SPI_miso_s.h"
#include "SPI_miso_s_aliases.h"
#include "SPI_sclk_s.h"
#include "SPI_sclk_s_aliases.h"
#include "SPI_mosi_s.h"
#include "SPI_mosi_s_aliases.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

